{
  "selected-works": [
    {
      "image": "https://www.travelawaits.com/wp-content/uploads/2022/07/Sunset-over-Clearwater-Beach-in-Florida-scaled.jpg?fit=1380%2C920",
      "title": "10 Affordable Clearwater Beach Vacation Rentals With Incredible Ocean Views",
      "description": "Clearwater got its name from the word Pocotopaug, meaning “Clear Water.” The Native Americans who lived in the region and observed the pristinely clear natural springs that appeared throughout gave the area that name. Nowadays, Clearwater is a bustling community that attracts visitors from around the world. From relaxing beach time and water sports opportunities at Clearwater Beach or nearby Sand Key to lively restaurants, there is something for everyone!",
      "link": "https://www.travelawaits.com/affiliate/vrbo-clearwater-beach/",
      "tags": ["Content-Writing", "SEO"]
    },
    {
      "image": "https://i0.wp.com/travelawaits.com/wp-content/uploads/2022/08/epcot1.jpg?resize=1024%2C768&ssl=1",
      "title": "I Worked At EPCOT, These Are My 10 Favorite Delicious Treats To Try At The Food And Wine Festival",
      "description": "EPCOT’s Food & Wine Festival is the most highly-anticipated festival of the year. Although other festivals, such as the Festival of the Arts and the Flower & Garden Festival, serve food and drink, this festival shines because of its attention to detail and taste. The foods presented during the festival partner wonderfully with wine, which is why there are so many meat dishes. Overall, the Food & Wine Festival has a more luxurious and unique feel to it when it comes to food and beverage.",
      "link": "https://www.travelawaits.com/2789559/best-food-and-wine-to-try-at-epcot-food-and-wine-festival/",
      "tags": ["Content-Writing", "SEO", "Photography"]
    },
    {
      "image": "https://ideasforus.org/wp-content/uploads/2021/01/joshua-sukoff-5DDYHjk_KMU-unsplash-scaled.jpg",
      "title": "Biden Rejoins Paris Climate Agreement",
      "description": "As part of his plan for the first 100 days of his presidency, America’s new President Joe Biden has rejoined the Paris Climate Agreement. The Paris Climate Agreement is an international treaty with the goal to combat climate change. He signed the executive order as one of his first initiatives as president. This act is significant because the United States is the second leading country in carbon dioxide emissions. These emissions are the major cause of global warming.  Since the United States is one of the countries that has the largest negative impact on the environment, it has the most responsibility and potential for change. Every decision our government makes concerning the climate is important. According to the United States Environmental Protection Agency, “the largest source of greenhouse gas emissions from human activities in the United States is from burning fossil fuels for electricity, heat, and transportation”",
      "link": "https://ideasforus.org/biden-rejoins-paris-climate-agreement/",
      "tags": ["Content-Writing", "SEO"]
    }
  ],
  "recent-works": [
    {
      "image": "https://images.unsplash.com/photo-1488590528505-98d2b5aba04b?q=80&w=2070&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
      "title": "Top 10 Free Online STEM Degrees",
      "description": "Are you looking to pursue a career in science, technology, engineering, and math (STEM) but are wary of the costs of higher education? You're not alone. Thankfully, there are many affordable STEM degrees you can choose from. These affordable options are also available online, which is great for working individuals and people with busy schedules. With these STEM programs, you don't have to worry about money and in-class attendance getting in the way of achieving your dreams.",
      "link": "https://learn.org/articles/stem_degrees_free_online.html",
      "tags": ["Content-Writing", "SEO"]
    },
    {
      "image": "https://plus.unsplash.com/premium_photo-1697730020369-ee69d96d1c21?q=80&w=1933&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
      "title": "How To Become a Teacher Online in Virginia",
      "description": "There are several requirements to becoming a teacher in the state of Virginia. Thankfully, many of these requirements can be completed online. This helps working individuals looking for a career change or with busy schedules. Aspiring teachers have many online degree programs and majors to choose from. Virginia has many accredited institutions offering education degrees so you can become a teacher online.",
      "link": "https://learn.org/articles/how_to_become_a_teacher_online_virginia.html",
      "tags": ["Content-Writing", "SEO"]
    },
    {
      "image": "https://images.unsplash.com/photo-1517120026326-d87759a7b63b?q=80&w=2070&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
      "title": "Can You Get a Nursing Degree Fully Online?",
      "description": "Whether you're a high school student planning to become a nurse or a working professional looking to advance your nursing career, you have probably heard of the various nursing degrees available. Now you're wondering: can you complete the required nursing classes online? ",
      "link": "https://learn.org/articles/can_you_get_a_nursing_degree_fully_online.html",
      "tags": ["Content-Editing", "SEO"]
    },
    {
      "image": "https://images.unsplash.com/photo-1573511860302-28c524319d2a?q=80&w=2070&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
      "title": "Is a Psychology Degree Right for Me?",
      "description": "Those of you seeking a degree in psychology will want to know if the degree is right for you. Thankfully, the area of psychology is vast, allowing you to learn about numerous psychology programs needed for your degree. When choosing a psychology degree, examine the various psychology careers available. ",
      "link": "https://learn.org/articles/psychology_degree_right_for_me.html",
      "tags": ["Content-Editing", "SEO"]
    },
    {
      "image": "https://plus.unsplash.com/premium_photo-1664542157770-6f18190fca70?q=80&w=2070&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
      "title": "Is Purdue Global LGBTQ-Friendly?",
      "description": "Purdue emerges as a trailblazing institution, leading the way in providing unwavering support for the LGBTQ+ community, a commitment that seamlessly transcends Purdue Global. The university's steadfast dedication to fostering inclusivity and excellence has earned it the distinguished title of being one of the 'Best of the Best' universities for LGBTQ+ students. This remarkable recognition is further solidified by Purdue's outstanding 5-star rating on the revered Campus Pride Index, a testament to the institution's tireless efforts in creating an environment where every individual feels a sense of belonging. In this vibrant atmosphere, diversity is not just acknowledged; it is celebrated as a cornerstone of Purdue's identity, reflecting a pledge to nurture an inclusive community that resonates with the principles of equality and acceptance for all. ",
      "link": "https://learn.org/articles/purdue_global_lgbtq_friendly.html",
      "tags": ["Content-Editing", "SEO"]
    },
    {
      "image": "https://images.unsplash.com/photo-1417733403748-83bbc7c05140?q=80&w=2070&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
      "title": "Best Free Associate Degrees Online | Learn.org",
      "description": "If you're considering college, you may be concerned about the cost. Even associate degrees can cost several thousand dollars; but are all degree programs expensive? Are there any schools offering free or inexpensive associate degrees? There are ways of getting an online associate degree for free or nearly free. Some schools offer tuition waivers for certain students, while others offer full-ride scholarships or partnerships that cover costs. Still, other schools don't offer low tuition rates and various financial aid options to help students attend school at greatly reduced out-of-pocket costs. Keep reading to find out more.",
      "link": "https://learn.org/articles/free_associate_degree_online.html",
      "tags": ["Content-Editing", "SEO"]
    },
    {
      "image": "https://images.unsplash.com/photo-1434030216411-0b793f4b4173?q=80&w=2070&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
      "title": "What Can You Do With a Social Work Degree Besides Social Work?",
      "description": "A social work degree prepares you to work with people struggling with disabilities, mental health issues, substance abuse, homelessness, and other social issues. But what if you don't want to work as a case manager or social worker? Are there other social work careers you could pursue? Those with social work degrees can work in many fields, such as healthcare, criminal justice, education, human services, other social services. If you want to keep your career options open, you can pursue a social work job in one of these related fields. Keep reading to find out more.",
      "link": "https://learn.org/articles/social_work_degree_career_options.html",
      "tags": ["Content-Editing", "SEO"]
    },
    {
      "image": "https://images.unsplash.com/photo-1620059116993-398c21ce8406?q=80&w=2070&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
      "title": "Which Military Branch Has the Best College Benefits?",
      "description": "Enlistment is a common career path for high school graduates due to the benefits associated with military service. Military members receive multiple benefits that make pursuing a college education easier, including military tuition assistance stipends, student loan repayment, and other education benefits. However, there is no federal mandate for the specific programs that each branch of the military offers. Each service branch has its tuition assistance programs and requirements. Some common education benefit requirements include years of service, the type of higher education being pursued, ongoing service commitment, and more. If you plan to pursue a degree program after your service, speak with recruiters to learn more about the individual benefit programs offered. Different branches will have better benefits for your higher education needs.",
      "link": "https://learn.org/articles/which_military_branch_has_best_college_benefits.html",
      "tags": ["Content-Editing", "SEO"]
    },
    {
      "image": "https://images.unsplash.com/photo-1445633883498-7f9922d37a3f?q=80&w=2070&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
      "title": "8 Best Mother-Daughter Experiences In London",
      "description": "London teems with historic and cultural activities. My daughter has loved Shakespeare and all of the English histories that he writes about. She also loves contemporary culture, including musicals, books, movies, and fashion. She chose London for her high school graduation trip due to this combination of history and modern life. The city offered us many opportunities for wonderful shared experiences. The West End rivals Broadway for the number and caliber of musical productions. My daughter has always loved the songs and dancing of musicals. She introduced me to her favorite musical, Come From Away, when a recording was made available. The story focuses on the town of Gander, in Newfoundland, which welcomed 7,000 passengers from planes diverted on September 11th. Each of the 12 actors portrays a resident of the town and one of the stranded passengers. The stage is sparsely set with 12 chairs that are reconfigured to create different settings. My daughter was very excited to be able to choose a musical to see in the West End. I splurged for seats with a good view. We sang along to the lively tunes and cried during the sad parts. At the end, we joined the crowd in cheering for several minutes and clapped along to the on-stage band. We ran right to the concession stand to buy matching “Me and the Sky” t-shirts. Taking the double-decker bus home enabled us to stay entranced with the night scene of the streets of London. Our ride home in the front seat of the second level was filled with our chatter about the musical. We often found ourselves singing some tidbit of one of the songs during the subsequent days.",
      "link": "https://www.travelawaits.com/2796747/best-mother-daughter-experiences-in-london/",
      "tags": ["Content-Editing", "SEO"]
    },
    {
      "image": "https://images.unsplash.com/photo-1586964699040-e548673911c9?q=80&w=1974&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
      "title": "11 Adorable Small Towns To Visit On Nova Scotia’s Southern Coast",
      "description": "For curious travelers eager to get off the proverbial beaten path, Nova Scotia’s southern coast will check all your travel boxes. There are amazing restaurants with delectable seafood, historic inns with gorgeous perennial gardens, delightful little lighthouses, and stunning beaches perfect for swimming and walking. All located just a few short hours from Halifax, these adorable small towns are a memorable addition to any East Coast road trip. I had the opportunity to visit them during a recent press trip and I can’t wait to return and explore some more! Digby is a seafood lover’s dream destination. Famous for having some of the biggest and best scallops in the world, Digby’s café scene promises to delight. Prices are affordable, servings are generous, and the nautical decor is charming. There’s excellent hiking nearby, especially around the coast and Prim Point Lighthouse (which overlooks the “Digby Gut”, the waterway which leads to the Bay of Fundy). ",
      "link": "https://www.travelawaits.com/2796920/best-small-towns-to-visit-nova-scotia-southern-coast/",
      "tags": ["Content-Editing", "SEO"]
    },
    {
      "image": "https://images.unsplash.com/photo-1672358941571-8ebd5e72522f?q=80&w=2070&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
      "title": "The 7 Best National Parks In California To Visit In The Fall",
      "description": "California is home to nine national parks and an additional 19 monuments, all showcasing a wide array of landscapes from the beach to desert and mountains to forests. Within this collection are some of the oldest and newest parks in the country. As one of the least visited national parks in the United States, visitors are really in for a treat when they make the trip to the Channel Islands. What makes it even better is the fact that it’s bordered by a national marine sanctuary. Combined, this enormous swath of land and water is protecting a significant amount of endangered and at-risk plant and animal life.",
      "link": "https://www.travelawaits.com/2796994/best-national-parks-in-california-to-visit-in-the-fall/",
      "tags": ["Content-Editing", "SEO"]
    },
    {
      "image": "https://ideasforus.org/wp-content/uploads/2021/03/IsGroveSustainable.jpg",
      "title": "Is Grove Sustainable?",
      "description": "Grove Collaborative is a company that ships natural home care essentials straight to your house every month. Their monthly boxes contain all kinds of products such as deodorants, toothpaste, laundry detergent, floor cleaners, and more. Some of the companies that they work with are Method, Mrs. Meyer’s, and Davids. Grove Collaborative also makes their own products. They claim that their collection is sustainable, powerful, and healthy. However, there is one problem. Many of the products they ship use plastic packaging. How true is the claim that they are sustainable, powerful, and healthy if many of their products use plastic packaging? On their homepage, under the section called “Imagine a World Beyond Plastic”, Grove Collaborative claimed that “By 2025, Grove will be 100% plastic-free”. Along with that claim, they also announced their new plastic-free soaps and cleaning supplies. Some of the products are also plant-based. So, what is the benefit of using Grove if you can find many of the supplies they offer at Target or Amazon?",
      "link": "https://ideasforus.org/is-grove-sustainable/",
      "tags": ["Content-Writing", "SEO"]
    },
    {
      "image": "https://images.unsplash.com/photo-1619549868808-85e186501875?q=80&w=1962&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
      "title": "Nestle to Deplete Ginnie Springs",
      "description": "Nestle to Deplete Ginnie Springs. Recently, a corporation called Seven Springs Water Co. attempted to renew their water permit allowing them to drain the water from Ginnie Springs to sell to Nestle Waters North America or NWNA.  However, this time they wanted to increase the amount of water they drained. The Suwannee River Water Management District stated that the Seven Springs Water Co. did not meet the requirements for the permit and that the amount of water they wanted was a significant increase that the governing board should reject (7). The Suwannee River staff reportedly stated, “the company had not provided them with enough information to show that the increased pumping was in the public interest and that their water plant could handle the boost,” (7). Seven Springs Water Co. challenged the permit denial and Judge G.W. Chisenhall sided with Seven Springs Water Co. against The Suwannee River Water Management District. Judge Chisenhall stated, “Seven Springs provided competent, substantial, and unrebutted evidence of the contractual obligation between it and Nestle, and of the obligation for all water to be used at the … bottling plant,” (2).",
      "link": "https://ideasforus.org/nestle-to-deplete-ginnie-springs/",
      "tags": ["Content-Writing", "SEO"]
    },
    {
      "image": "https://delcarmzdotcom.wordpress.com/wp-content/uploads/2019/08/mydisneyexperienceapp.jpg?w=656&h=300&crop=1",
      "title": "My Disney Experience App-Walt Disney World",
      "description": "This blog post has been greatly requested. It seems that many people still don’t know about this app or don’t take advantage of all it’s features because I still see surprised looks on people’s faces whenever they see me pull out my phone to place a mobile order. Recently, I traveled to the Animal Kingdom park to show some of the various ways the My Disney Experience app can be used to optimize your trip. Since the app can track your location, it instantly knew that I was in the park. Shortly after I entered the Animal Kingdom, I received the message shown in the image above. I appreciated the warm welcome. Hopefully, this blog post will spread more awareness about this app and it’s many helpful features so guests can make the most out of their visit to Walt Disney World. Once you sign in, you can access a menu where you can link your tickets, dining plans, photos, hotel/resort stay information, and magic band or card. You can’t make a hotel reservation through the app but you can access a phone number to make the reservation through a web link inside the app. Once you link your passes, a world of options opens up for you. One of those options is to reserve fast passes to your account.",
      "link": "https://delcarmzdotcom.wordpress.com/2019/08/08/my-disney-experience-app-walt-disney-world%e2%9c%a8/",
      "tags": ["Content-Writing", "SEO", "Photography"]
    },
    {
      "image": "https://delcarmzdotcom.wordpress.com/wp-content/uploads/2019/08/secondharvestfoodbank.jpg?w=656&h=300&crop=1",
      "title": "Volunteering at Second Harvest Food Bank of Central Florida!",
      "description": "Hello reader! You may be thinking, “isn’t this a Disney blog? Why are you writing about volunteering at a food bank?” Well, I’ve been thinking about branching out on what I write about. Orlando is a vast landscape full of different experiences that I would love to explore on my blog. That being said, Second Harvest Food Bank is a beneficiary of Disney’s Harvest program that supports many non-profit organizations with food, money, and volunteers.",
      "link": "https://delcarmzdotcom.wordpress.com/2019/08/02/volunteering-at-second-harvest-food-bank-of-central-florida/",
      "tags": ["Content-Writing", "SEO", "Photography"]
    },
    {
      "image": "https://delcarmzdotcom.wordpress.com/wp-content/uploads/2019/07/mkfireworks.png?w=656&h=300&crop=1",
      "title": "Spending July 4th at Magic Kingdom",
      "description": "It’s been a while! I’m glad to be back and write about some of my recent experiences at Walt Disney World. Today, we’re focusing on the Independence Day celebration at the Magic Kingdom. If you want to fast-forward to my review of the overall experience, scroll to the bottom of the post. The review will be in a light pink box. The first thing I noticed when I walked into the Magic Kingdom were the Independence Day decorations spread throughout Main Street. One of the many joys of visiting the Walt Disney World parks is seeing how they decorate each area depending on the season, festival, or celebration that is happening during that time. The colorful decorations built-up excitement within me for what was to come. The anticipation for the fireworks show boiled up inside me.",
      "link": "https://delcarmzdotcom.wordpress.com/2019/07/26/spending-july-4th-at-magic-kingdom/",
      "tags": ["Content-Writing", "SEO", "Photography"]
    },
    {
      "image": "https://delcarmzdotcom.wordpress.com/wp-content/uploads/2019/06/hollywoodstudiosplay1.jpg?w=656&h=300&crop=1",
      "title": "Play Disney Parks app + Star War’s Galaxy’s Edge update!",
      "description": "Looking to kill time during long ride wait times or just trying to make the most out of your Disney visit? Look no further! The Play Disney Parks app will make your trip even more exciting by challenging you, your family, and friends to visit different parts of the park and achieve objectives by playing games or simply checking in through the Bluetooth function. Before I start this post, I wanted to say that this app is not new. It’s been out since late 2018 but I’m making this post because many people I’ve spoken to had no idea this app existed! What is new, is that the Star Wars Galaxy’s Edge area has been added to the app. If you want to know more, keep scrolling!",
      "link": "https://delcarmzdotcom.wordpress.com/2019/06/11/things-you-may-not-have-known-you-could-do-at-disney-part-1-play-disney-parks-app-star-wars-galaxys-edge-update/",
      "tags": ["Content-Writing", "SEO", "Photography"]
    }
  ]
}
